# Import  required libary

In [41]:
import pandas as pd
from pandas import DataFrame,Series
import numpy as np

In [5]:
df=pd.Series([1,2,3,5,7,9])
df

0    1
1    2
2    3
3    5
4    7
5    9
dtype: int64

In [6]:
df.values

array([1, 2, 3, 5, 7, 9], dtype=int64)

In [7]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [8]:
df2=pd.Series([1,2,3,46,5],index=['a','b','c','d','e'])
df2

a     1
b     2
c     3
d    46
e     5
dtype: int64

In [9]:
df2.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [10]:
df2['a']

1

In [11]:
df2[['b','c','d']]

b     2
c     3
d    46
dtype: int64

In [15]:
df2[df2>4]

d    46
e     5
dtype: int64

In [16]:
df2*2

a     2
b     4
c     6
d    92
e    10
dtype: int64

In [17]:
df2**2

a       1
b       4
c       9
d    2116
e      25
dtype: int64

In [19]:
np.exp(df2)

a    2.718282e+00
b    7.389056e+00
c    2.008554e+01
d    9.496119e+19
e    1.484132e+02
dtype: float64

In [22]:
"a" in df2

True

dict to series

In [43]:
dic={"Name":"Ali","Reg no":12,"marks":123}
df3=pd.Series(dic)
df3

Name      Ali
Reg no     12
marks     123
dtype: object

In [46]:
pd.isnull(df3)

Name      False
Reg no    False
marks     False
dtype: bool

In [48]:
pd.notnull(df3)

Name      True
Reg no    True
marks     True
dtype: bool

In [49]:
df3.isnull()

Name      False
Reg no    False
marks     False
dtype: bool

In [55]:
df3.name='pop'
df3.index.name="state"
df3

state
Name      Ali
Reg no     12
marks     123
Name: pop, dtype: object

In [56]:
df

0    1
1    2
2    3
3    5
4    7
5    9
dtype: int64

In [59]:
df.index=['x','y','z','a','b','c']
df

x    1
y    2
z    3
a    5
b    7
c    9
dtype: int64

# data frame

In [74]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
'year': [2000, 2001, 2002, 2001, 2002, 2003],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
data1=pd.DataFrame(data) 
data1

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [75]:
data1.head(2)

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1.7

In [81]:
data1=pd.DataFrame(data,columns=['state','year','pop'])
data1.head(3)

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1.7
2  Ohio  2002  3.6

In [82]:
data2=pd.DataFrame(data,columns=['state','year','pop','extra'],
                   index=['a','b','c','d','e','f'])
data2

    state  year  pop extra
a    Ohio  2000  1.5   NaN
b    Ohio  2001  1.7   NaN
c    Ohio  2002  3.6   NaN
d  Nevada  2001  2.4   NaN
e  Nevada  2002  2.9   NaN
f  Nevada  2003  3.2   NaN

In [83]:
data2.columns

Index(['state', 'year', 'pop', 'extra'], dtype='object')

In [85]:
data2["year"]

a    2000
b    2001
c    2002
d    2001
e    2002
f    2003
Name: year, dtype: int64

In [88]:
data2[["state","extra"]]

    state extra
a    Ohio   NaN
b    Ohio   NaN
c    Ohio   NaN
d  Nevada   NaN
e  Nevada   NaN
f  Nevada   NaN

In [94]:
data2.loc["a"]

state    Ohio
year     2000
pop       1.5
extra     NaN
Name: a, dtype: object

In [96]:
data2["extra"]=12
data2

    state  year  pop  extra
a    Ohio  2000  1.5     12
b    Ohio  2001  1.7     12
c    Ohio  2002  3.6     12
d  Nevada  2001  2.4     12
e  Nevada  2002  2.9     12
f  Nevada  2003  3.2     12

In [100]:
data2["extra"]=np.arange(6)
data2

    state  year  pop  extra
a    Ohio  2000  1.5      0
b    Ohio  2001  1.7      1
c    Ohio  2002  3.6      2
d  Nevada  2001  2.4      3
e  Nevada  2002  2.9      4
f  Nevada  2003  3.2      5

In [103]:
val=pd.Series([0.9,1,999],index=["f","b",'d'])

In [105]:
data2["extra"]=val
data2

    state  year  pop  extra
a    Ohio  2000  1.5    NaN
b    Ohio  2001  1.7    1.0
c    Ohio  2002  3.6    NaN
d  Nevada  2001  2.4  999.0
e  Nevada  2002  2.9    NaN
f  Nevada  2003  3.2    0.9

In [111]:
data2["extra2"]=data2.state=="Nevada"

In [112]:
data2

    state  year  pop  extra  extra2
a    Ohio  2000  1.5    NaN   False
b    Ohio  2001  1.7    1.0   False
c    Ohio  2002  3.6    NaN   False
d  Nevada  2001  2.4  999.0    True
e  Nevada  2002  2.9    NaN    True
f  Nevada  2003  3.2    0.9    True

In [113]:
data2.columns

Index(['state', 'year', 'pop', 'extra', 'extra2'], dtype='object')

In [114]:
data2.T

            a      b      c       d       e       f
state    Ohio   Ohio   Ohio  Nevada  Nevada  Nevada
year     2000   2001   2002    2001    2002    2003
pop       1.5    1.7    3.6     2.4     2.9     3.2
extra     NaN    1.0    NaN   999.0     NaN     0.9
extra2  False  False  False    True    True    True

In [115]:
data2.T

            a      b      c       d       e       f
state    Ohio   Ohio   Ohio  Nevada  Nevada  Nevada
year     2000   2001   2002    2001    2002    2003
pop       1.5    1.7    3.6     2.4     2.9     3.2
extra     NaN    1.0    NaN   999.0     NaN     0.9
extra2  False  False  False    True    True    True

In [118]:
data2.index.name="xyz"
data2.index.columns='hearo'

In [119]:
data2

      state  year  pop  extra  extra2
xyz
a      Ohio  2000  1.5    NaN   False
b      Ohio  2001  1.7    1.0   False
c      Ohio  2002  3.6    NaN   False
d    Nevada  2001  2.4  999.0    True
e    Nevada  2002  2.9    NaN    True
f    Nevada  2003  3.2    0.9    True

In [120]:
data2.values

array([['Ohio', 2000, 1.5, nan, False],
       ['Ohio', 2001, 1.7, 1.0, False],
       ['Ohio', 2002, 3.6, nan, False],
       ['Nevada', 2001, 2.4, 999.0, True],
       ['Nevada', 2002, 2.9, nan, True],
       ['Nevada', 2003, 3.2, 0.9, True]], dtype=object)